## Pandas

In [2]:
# 과제 설명이나 질문의 경우 마크다운 셀을 이용할 것.

Pandas
- 하나의 열 또는 행을 series data라고 함.
- 전체 테이블을 data frame이라고 함.

In [16]:
import pandas as pd

student = ['Gildong Hong', 'Jane Austin', 'Alia Bhatt']
print(pd.Series(student))

0    Gildong Hong
1     Jane Austin
2      Alia Bhatt
dtype: object

In [55]:
numbers = [*range(1, 4)] # [1, 4)
numbers_s = pd.Series(numbers)
print(numbers_s)
print(numbers_s.index) # index is created implicitly

0    1
1    2
2    3
dtype: int64
RangeIndex(start=0, stop=3, step=1)

In [6]:
student_no_name = {'10001':'Gildong Hong',
                   '10002':'Jane Austin',
                   '10003':'Alia Bhatt',
                   '10004':'Tony Leung'}
student_info = pd.Series(student_no_name)
student_info # explicit index specification

10001    Gildong Hong
10002     Jane Austin
10003      Alia Bhatt
10004      Tony Leung
dtype: object

In [17]:
student_no_name2 = { 10001:'Gildong Hong',
                   10002:'Jane Austin',
                   10003:'Alia Bhatt',
                   10004:'Tony Leung'}
student_info2 = pd.Series(student_no_name2)
student_info2 # 정수도 가능..은 함.

10001    Gildong Hong
10002     Jane Austin
10003      Alia Bhatt
10004      Tony Leung
dtype: object

In [56]:
print(student_info.index)
print(student_info2.index)

Index(['10001', '10002', '10003', '10004'], dtype='object')
Int64Index([10001, 10002, 10003, 10004], dtype='int64')

계산을 할 거라면 index를 정수형으로 쓰는 게 좋지만,  
계산을 하지 않을 거라면 텍스트형이 좋음.  
앞에 0이 오는 경우 텍스트형은 보존이 되지만, 정수는 0이 날아감.

In [10]:
student = pd.Series(['Gildong Hong', 'Jane Austin', 'Alia Bhat'], index=['10011', '10012', '10013'])
student.index

Index(['10011', '10012', '10013'], dtype='object')

In [ ]:
student = pd.Series(['Gildong Hong', 'Jane Austin', 'Alia Bhat', 'ADDITIONAL NAME'],
                    index=['10011', '10012', '10013'])
student.index # items != index mismatch => ERROR

In [12]:
student_no_name = {'10001':'Gildong Hong',
                   '10002':'Jane Austin',
                   '10003':'Alia Bhatt',
                   '10004':'Tony Leung'}
student_info = pd.Series(student_no_name, index=['10001', '10002', '10005'])
student_info # student_no_name 기준으로 인덱스 지정

10001    Gildong Hong
10002     Jane Austin
10005             NaN
dtype: object

In [13]:
student_info = pd.Series(student_no_name)

print(student_info.iloc[1]) # 0, 1, 2, ...인덱스
print(student_info[1]) 
print(student_info.loc['10004']) # 명시적으로 지정한 인덱스
print(student_info['10004'])

Jane Austin
Jane Austin
Tony Leung
Tony Leung

iloc, loc 생략해도 잘 작동은 함. **근데 그러지 말라.**

In [14]:
student_no_name2 = {1 : 'Apple', 2: 'Banana', 3: 'Cheese'}
student_info2 = pd.Series(student_no_name2)

student_info2[1] # 뭘까요? Banana? Apple? -- 헷갈림.

'Apple'

In [15]:
# student_list = student_info.append(student_info2)
# deprectated...

student_list = pd.concat([student_info, student_info2])
student_list

10001    Gildong Hong
10002     Jane Austin
10003      Alia Bhatt
10004      Tony Leung
1               Apple
2              Banana
3              Cheese
dtype: object

In [70]:
students_1 = pd.Series({'이름':'홍길동', '전화번호':'010-1234-1234', '포인트':90})
students_2 = pd.Series({'이름':'허춘삼', '전화번호':'010-1674-1237', '포인트':60})
students_3 = pd.Series({'이름':'고길동', '전화번호':'010-9764-1234', '포인트':22.5})

df = pd.DataFrame([students_1, students_2, students_3])
display(df)

df = pd.DataFrame([students_1, students_2, students_3], index=['10001', '10002', '10003'])
display(df)

    이름           전화번호   포인트
0  홍길동  010-1234-1234  90.0
1  허춘삼  010-1674-1237  60.0
2  고길동  010-9764-1234  22.5

        이름           전화번호   포인트
10001  홍길동  010-1234-1234  90.0
10002  허춘삼  010-1674-1237  60.0
10003  고길동  010-9764-1234  22.5

In [62]:
print(type(df))
print(df.index)

<class 'pandas.core.frame.DataFrame'>
Index(['10001', '10002', '10003'], dtype='object')

In [72]:
print(df.iloc[1]) # => 시리즈 데이터
print()
print(df.loc['10001']) # => 마찬가지로 시리즈 데이터

이름                허춘삼
전화번호    010-1674-1237
포인트              60.0
Name: 10002, dtype: object

이름                홍길동
전화번호    010-1234-1234
포인트              90.0
Name: 10001, dtype: object

In [ ]:
df['10001'] # ERROR!!!! 이건 column을 선택하는 거임.

In [66]:
df['이름'] # iloc, loc 없으면 column 선택

10001    홍길동
10002    허춘삼
10003    고길동
Name: 이름, dtype: object

In [69]:
display(df.iloc[:,:]) # 행-열 (row, column)
display(df.iloc[0:2,0:2])

        이름           전화번호   포인트
10001  홍길동  010-1234-1234  90.0
10002  허춘삼  010-1674-1237  60.0
10003  고길동  010-9764-1234  22.5

        이름           전화번호
10001  홍길동  010-1234-1234
10002  허춘삼  010-1674-1237

In [41]:
df['포인트']              # => Series

10001    90.0
10002    60.0
10003    22.5
Name: 포인트, dtype: float64

In [73]:
display(df[    ['이름', '포인트']      ]) # 2중 대괄호 사용 => DataFrame
display(df.loc[:, ['이름', '포인트']]) # OK

        이름   포인트
10001  홍길동  90.0
10002  허춘삼  60.0
10003  고길동  22.5

        이름   포인트
10001  홍길동  90.0
10002  허춘삼  60.0
10003  고길동  22.5

In [ ]:
df.loc[0:2, ['이름', '포인트']] # ERROR (loc => 암시적 인덱스가 올 수 없음.)

In [50]:
df.loc[['10001','10002'], ['이름', '포인트']] # OK

        이름   포인트
10001  홍길동  90.0
10002  허춘삼  60.0

In [53]:
df['이름'] == '홍길동'

10001     True
10002    False
10003    False
Name: 이름, dtype: bool

In [54]:
df[     df['이름'] == '홍길동'     ]  # 위 결과를 다시 df로 전달해서 뽑아내기. Boolean Indexing?
# SELECT * FROM df WHERE 이름 = '홍길동'

        이름           전화번호   포인트
10001  홍길동  010-1234-1234  90.0